Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_curiosity_pro/pic32cm_jh01_cpro_getting_started/firmware/src/packs/PIC32CM5164JH01100_DFP/component/oscctrl.h
/*
 * Component description for OSCCTRL
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-04-26T09:03:33Z */
#ifndef _PIC32CMJH01_OSCCTRL_COMPONENT_H_
#define _PIC32CMJH01_OSCCTRL_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR OSCCTRL                                      */
/* ************************************************************************** */

/* -------- OSCCTRL_INTENCLR : (OSCCTRL Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#define OSCCTRL_INTENCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define OSCCTRL_INTENCLR_XOSCRDY_Pos          _UINT32_(0)                                          /* (OSCCTRL_INTENCLR) XOSC Ready Interrupt Enable Position */
#define OSCCTRL_INTENCLR_XOSCRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_XOSCRDY_Pos)      /* (OSCCTRL_INTENCLR) XOSC Ready Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_XOSCRDY(value)       (OSCCTRL_INTENCLR_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_XOSCFAIL_Pos         _UINT32_(1)                                          /* (OSCCTRL_INTENCLR) XOSC Clock Failure Detector Interrupt Enable Position */
#define OSCCTRL_INTENCLR_XOSCFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_XOSCFAIL_Pos)     /* (OSCCTRL_INTENCLR) XOSC Clock Failure Detector Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_XOSCFAIL(value)      (OSCCTRL_INTENCLR_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_OSC48MRDY_Pos        _UINT32_(4)                                          /* (OSCCTRL_INTENCLR) OSC48M Ready Interrupt Enable Position */
#define OSCCTRL_INTENCLR_OSC48MRDY_Msk        (_UINT32_(0x1) << OSCCTRL_INTENCLR_OSC48MRDY_Pos)    /* (OSCCTRL_INTENCLR) OSC48M Ready Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_OSC48MRDY(value)     (OSCCTRL_INTENCLR_OSC48MRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_OSC48MRDY_Pos)) /* Assigment of value for OSC48MRDY in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DPLLLCKR_Pos         _UINT32_(8)                                          /* (OSCCTRL_INTENCLR) DPLL Lock Rise Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DPLLLCKR_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_DPLLLCKR_Pos)     /* (OSCCTRL_INTENCLR) DPLL Lock Rise Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DPLLLCKR(value)      (OSCCTRL_INTENCLR_DPLLLCKR_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DPLLLCKF_Pos         _UINT32_(9)                                          /* (OSCCTRL_INTENCLR) DPLL Lock Fall Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DPLLLCKF_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_DPLLLCKF_Pos)     /* (OSCCTRL_INTENCLR) DPLL Lock Fall Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DPLLLCKF(value)      (OSCCTRL_INTENCLR_DPLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DPLLLTO_Pos          _UINT32_(10)                                         /* (OSCCTRL_INTENCLR) DPLL Time Out Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DPLLLTO_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DPLLLTO_Pos)      /* (OSCCTRL_INTENCLR) DPLL Time Out Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DPLLLTO(value)       (OSCCTRL_INTENCLR_DPLLLTO_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DPLLLDRTO_Pos        _UINT32_(11)                                         /* (OSCCTRL_INTENCLR) DPLL Ratio Ready Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DPLLLDRTO_Msk        (_UINT32_(0x1) << OSCCTRL_INTENCLR_DPLLLDRTO_Pos)    /* (OSCCTRL_INTENCLR) DPLL Ratio Ready Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DPLLLDRTO(value)     (OSCCTRL_INTENCLR_DPLLLDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DPLLLDRTO_Pos)) /* Assigment of value for DPLLLDRTO in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_Msk                  _UINT32_(0x00000F13)                                 /* (OSCCTRL_INTENCLR) Register Mask  */


/* -------- OSCCTRL_INTENSET : (OSCCTRL Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define OSCCTRL_INTENSET_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_INTENSET) Interrupt Enable Set  Reset Value */

#define OSCCTRL_INTENSET_XOSCRDY_Pos          _UINT32_(0)                                          /* (OSCCTRL_INTENSET) XOSC Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCRDY_Pos)      /* (OSCCTRL_INTENSET) XOSC Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCRDY(value)       (OSCCTRL_INTENSET_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_XOSCFAIL_Pos         _UINT32_(1)                                          /* (OSCCTRL_INTENSET) XOSC Clock Failure Detector Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCFAIL_Pos)     /* (OSCCTRL_INTENSET) XOSC Clock Failure Detector Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCFAIL(value)      (OSCCTRL_INTENSET_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_OSC48MRDY_Pos        _UINT32_(4)                                          /* (OSCCTRL_INTENSET) OSC48M Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_OSC48MRDY_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_OSC48MRDY_Pos)    /* (OSCCTRL_INTENSET) OSC48M Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_OSC48MRDY(value)     (OSCCTRL_INTENSET_OSC48MRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_OSC48MRDY_Pos)) /* Assigment of value for OSC48MRDY in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLLLCKR_Pos         _UINT32_(8)                                          /* (OSCCTRL_INTENSET) DPLL Lock Rise Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLLLCKR_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLLLCKR_Pos)     /* (OSCCTRL_INTENSET) DPLL Lock Rise Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLLLCKR(value)      (OSCCTRL_INTENSET_DPLLLCKR_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLLLCKF_Pos         _UINT32_(9)                                          /* (OSCCTRL_INTENSET) DPLL Lock Fall Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLLLCKF_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLLLCKF_Pos)     /* (OSCCTRL_INTENSET) DPLL Lock Fall Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLLLCKF(value)      (OSCCTRL_INTENSET_DPLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLLLTO_Pos          _UINT32_(10)                                         /* (OSCCTRL_INTENSET) DPLL Time Out Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLLLTO_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLLLTO_Pos)      /* (OSCCTRL_INTENSET) DPLL Time Out Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLLLTO(value)       (OSCCTRL_INTENSET_DPLLLTO_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLLLDRTO_Pos        _UINT32_(11)                                         /* (OSCCTRL_INTENSET) DPLL Ratio Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLLLDRTO_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLLLDRTO_Pos)    /* (OSCCTRL_INTENSET) DPLL Ratio Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLLLDRTO(value)     (OSCCTRL_INTENSET_DPLLLDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLLLDRTO_Pos)) /* Assigment of value for DPLLLDRTO in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_Msk                  _UINT32_(0x00000F13)                                 /* (OSCCTRL_INTENSET) Register Mask  */


/* -------- OSCCTRL_INTFLAG : (OSCCTRL Offset: 0x08) (R/W 32) Interrupt Flag Status and Clear -------- */
#define OSCCTRL_INTFLAG_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

