Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_curiosity_pro/pic32cm_jh01_cpro_getting_started/firmware/src/packs/PIC32CM5164JH01100_DFP/component/oscctrl.h
#define OSCCTRL_INTFLAG_XOSCRDY_Pos           _UINT32_(0)                                          /* (OSCCTRL_INTFLAG) XOSC Ready Position */
#define OSCCTRL_INTFLAG_XOSCRDY_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCRDY_Pos)       /* (OSCCTRL_INTFLAG) XOSC Ready Mask */
#define OSCCTRL_INTFLAG_XOSCRDY(value)        (OSCCTRL_INTFLAG_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_XOSCFAIL_Pos          _UINT32_(1)                                          /* (OSCCTRL_INTFLAG) XOSC Clock Failure Detector Position */
#define OSCCTRL_INTFLAG_XOSCFAIL_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)      /* (OSCCTRL_INTFLAG) XOSC Clock Failure Detector Mask */
#define OSCCTRL_INTFLAG_XOSCFAIL(value)       (OSCCTRL_INTFLAG_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_OSC48MRDY_Pos         _UINT32_(4)                                          /* (OSCCTRL_INTFLAG) OSC48M Ready Position */
#define OSCCTRL_INTFLAG_OSC48MRDY_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_OSC48MRDY_Pos)     /* (OSCCTRL_INTFLAG) OSC48M Ready Mask */
#define OSCCTRL_INTFLAG_OSC48MRDY(value)      (OSCCTRL_INTFLAG_OSC48MRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_OSC48MRDY_Pos)) /* Assigment of value for OSC48MRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLCKR_Pos          _UINT32_(8)                                          /* (OSCCTRL_INTFLAG) DPLL Lock Rise Position */
#define OSCCTRL_INTFLAG_DPLLLCKR_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLCKR_Pos)      /* (OSCCTRL_INTFLAG) DPLL Lock Rise Mask */
#define OSCCTRL_INTFLAG_DPLLLCKR(value)       (OSCCTRL_INTFLAG_DPLLLCKR_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLCKF_Pos          _UINT32_(9)                                          /* (OSCCTRL_INTFLAG) DPLL Lock Fall Position */
#define OSCCTRL_INTFLAG_DPLLLCKF_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLCKF_Pos)      /* (OSCCTRL_INTFLAG) DPLL Lock Fall Mask */
#define OSCCTRL_INTFLAG_DPLLLCKF(value)       (OSCCTRL_INTFLAG_DPLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLTO_Pos           _UINT32_(10)                                         /* (OSCCTRL_INTFLAG) DPLL Timeout Position */
#define OSCCTRL_INTFLAG_DPLLLTO_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLTO_Pos)       /* (OSCCTRL_INTFLAG) DPLL Timeout Mask */
#define OSCCTRL_INTFLAG_DPLLLTO(value)        (OSCCTRL_INTFLAG_DPLLLTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLDRTO_Pos         _UINT32_(11)                                         /* (OSCCTRL_INTFLAG) DPLL Ratio Ready Position */
#define OSCCTRL_INTFLAG_DPLLLDRTO_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLDRTO_Pos)     /* (OSCCTRL_INTFLAG) DPLL Ratio Ready Mask */
#define OSCCTRL_INTFLAG_DPLLLDRTO(value)      (OSCCTRL_INTFLAG_DPLLLDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLDRTO_Pos)) /* Assigment of value for DPLLLDRTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_Msk                   _UINT32_(0x00000F13)                                 /* (OSCCTRL_INTFLAG) Register Mask  */


/* -------- OSCCTRL_STATUS : (OSCCTRL Offset: 0x0C) ( R/ 32) Power and Clocks Status -------- */
#define OSCCTRL_STATUS_RESETVALUE             _UINT32_(0x00)                                       /*  (OSCCTRL_STATUS) Power and Clocks Status  Reset Value */

#define OSCCTRL_STATUS_XOSCRDY_Pos            _UINT32_(0)                                          /* (OSCCTRL_STATUS) XOSC Ready Position */
#define OSCCTRL_STATUS_XOSCRDY_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCRDY_Pos)        /* (OSCCTRL_STATUS) XOSC Ready Mask */
#define OSCCTRL_STATUS_XOSCRDY(value)         (OSCCTRL_STATUS_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCFAIL_Pos           _UINT32_(1)                                          /* (OSCCTRL_STATUS) XOSC Clock Failure Detector Position */
#define OSCCTRL_STATUS_XOSCFAIL_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCFAIL_Pos)       /* (OSCCTRL_STATUS) XOSC Clock Failure Detector Mask */
#define OSCCTRL_STATUS_XOSCFAIL(value)        (OSCCTRL_STATUS_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCCKSW_Pos           _UINT32_(2)                                          /* (OSCCTRL_STATUS) XOSC Clock Switch Position */
#define OSCCTRL_STATUS_XOSCCKSW_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCCKSW_Pos)       /* (OSCCTRL_STATUS) XOSC Clock Switch Mask */
#define OSCCTRL_STATUS_XOSCCKSW(value)        (OSCCTRL_STATUS_XOSCCKSW_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCCKSW_Pos)) /* Assigment of value for XOSCCKSW in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_OSC48MRDY_Pos          _UINT32_(4)                                          /* (OSCCTRL_STATUS) OSC48M Ready Position */
#define OSCCTRL_STATUS_OSC48MRDY_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_OSC48MRDY_Pos)      /* (OSCCTRL_STATUS) OSC48M Ready Mask */
#define OSCCTRL_STATUS_OSC48MRDY(value)       (OSCCTRL_STATUS_OSC48MRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_OSC48MRDY_Pos)) /* Assigment of value for OSC48MRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLCKR_Pos           _UINT32_(8)                                          /* (OSCCTRL_STATUS) DPLL Lock Rise Position */
#define OSCCTRL_STATUS_DPLLLCKR_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLCKR_Pos)       /* (OSCCTRL_STATUS) DPLL Lock Rise Mask */
#define OSCCTRL_STATUS_DPLLLCKR(value)        (OSCCTRL_STATUS_DPLLLCKR_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLCKF_Pos           _UINT32_(9)                                          /* (OSCCTRL_STATUS) DPLL Lock Fall Position */
#define OSCCTRL_STATUS_DPLLLCKF_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLCKF_Pos)       /* (OSCCTRL_STATUS) DPLL Lock Fall Mask */
#define OSCCTRL_STATUS_DPLLLCKF(value)        (OSCCTRL_STATUS_DPLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLTO_Pos            _UINT32_(10)                                         /* (OSCCTRL_STATUS) DPLL Timeout Position */
#define OSCCTRL_STATUS_DPLLLTO_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLTO_Pos)        /* (OSCCTRL_STATUS) DPLL Timeout Mask */
#define OSCCTRL_STATUS_DPLLLTO(value)         (OSCCTRL_STATUS_DPLLLTO_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLDRTO_Pos          _UINT32_(11)                                         /* (OSCCTRL_STATUS) DPLL Ratio Ready Position */
#define OSCCTRL_STATUS_DPLLLDRTO_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLDRTO_Pos)      /* (OSCCTRL_STATUS) DPLL Ratio Ready Mask */
#define OSCCTRL_STATUS_DPLLLDRTO(value)       (OSCCTRL_STATUS_DPLLLDRTO_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLDRTO_Pos)) /* Assigment of value for DPLLLDRTO in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_Msk                    _UINT32_(0x00000F17)                                 /* (OSCCTRL_STATUS) Register Mask  */


/* -------- OSCCTRL_XOSCCTRL : (OSCCTRL Offset: 0x10) (R/W 16) External Multipurpose Crystal Oscillator (XOSC) Control -------- */
#define OSCCTRL_XOSCCTRL_RESETVALUE           _UINT16_(0x80)                                       /*  (OSCCTRL_XOSCCTRL) External Multipurpose Crystal Oscillator (XOSC) Control  Reset Value */

#define OSCCTRL_XOSCCTRL_ENABLE_Pos           _UINT16_(1)                                          /* (OSCCTRL_XOSCCTRL) Oscillator Enable Position */
#define OSCCTRL_XOSCCTRL_ENABLE_Msk           (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_ENABLE_Pos)       /* (OSCCTRL_XOSCCTRL) Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRL_ENABLE(value)        (OSCCTRL_XOSCCTRL_ENABLE_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_XTALEN_Pos           _UINT16_(2)                                          /* (OSCCTRL_XOSCCTRL) Crystal Oscillator Enable Position */
#define OSCCTRL_XOSCCTRL_XTALEN_Msk           (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_XTALEN_Pos)       /* (OSCCTRL_XOSCCTRL) Crystal Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRL_XTALEN(value)        (OSCCTRL_XOSCCTRL_XTALEN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_XTALEN_Pos)) /* Assigment of value for XTALEN in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_CFDEN_Pos            _UINT16_(3)                                          /* (OSCCTRL_XOSCCTRL) Xosc Clock Failure Detector Enable Position */
#define OSCCTRL_XOSCCTRL_CFDEN_Msk            (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_CFDEN_Pos)        /* (OSCCTRL_XOSCCTRL) Xosc Clock Failure Detector Enable Mask */
#define OSCCTRL_XOSCCTRL_CFDEN(value)         (OSCCTRL_XOSCCTRL_CFDEN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_CFDEN_Pos)) /* Assigment of value for CFDEN in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_SWBEN_Pos            _UINT16_(4)                                          /* (OSCCTRL_XOSCCTRL) Clock Switch Back Enable Position */
#define OSCCTRL_XOSCCTRL_SWBEN_Msk            (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_SWBEN_Pos)        /* (OSCCTRL_XOSCCTRL) Clock Switch Back Enable Mask */
#define OSCCTRL_XOSCCTRL_SWBEN(value)         (OSCCTRL_XOSCCTRL_SWBEN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_SWBEN_Pos)) /* Assigment of value for SWBEN in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_RUNSTDBY_Pos         _UINT16_(6)                                          /* (OSCCTRL_XOSCCTRL) Run in Standby Position */
#define OSCCTRL_XOSCCTRL_RUNSTDBY_Msk         (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_RUNSTDBY_Pos)     /* (OSCCTRL_XOSCCTRL) Run in Standby Mask */
#define OSCCTRL_XOSCCTRL_RUNSTDBY(value)      (OSCCTRL_XOSCCTRL_RUNSTDBY_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_ONDEMAND_Pos         _UINT16_(7)                                          /* (OSCCTRL_XOSCCTRL) On Demand Control Position */
#define OSCCTRL_XOSCCTRL_ONDEMAND_Msk         (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_ONDEMAND_Pos)     /* (OSCCTRL_XOSCCTRL) On Demand Control Mask */
#define OSCCTRL_XOSCCTRL_ONDEMAND(value)      (OSCCTRL_XOSCCTRL_ONDEMAND_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_GAIN_Pos             _UINT16_(8)                                          /* (OSCCTRL_XOSCCTRL) Oscillator Gain Position */
#define OSCCTRL_XOSCCTRL_GAIN_Msk             (_UINT16_(0x7) << OSCCTRL_XOSCCTRL_GAIN_Pos)         /* (OSCCTRL_XOSCCTRL) Oscillator Gain Mask */
#define OSCCTRL_XOSCCTRL_GAIN(value)          (OSCCTRL_XOSCCTRL_GAIN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_GAIN_Pos)) /* Assigment of value for GAIN in the OSCCTRL_XOSCCTRL register */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN2_Val     _UINT16_(0x0)                                        /* (OSCCTRL_XOSCCTRL) 2 MHz  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN4_Val     _UINT16_(0x1)                                        /* (OSCCTRL_XOSCCTRL) 4 MHz  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN8_Val     _UINT16_(0x2)                                        /* (OSCCTRL_XOSCCTRL) 8 MHz  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN16_Val    _UINT16_(0x3)                                        /* (OSCCTRL_XOSCCTRL) 16 MHz  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN32_Val    _UINT16_(0x4)                                        /* (OSCCTRL_XOSCCTRL) 32 MHz  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN2           (OSCCTRL_XOSCCTRL_GAIN_GAIN2_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 2 MHz Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN4           (OSCCTRL_XOSCCTRL_GAIN_GAIN4_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 4 MHz Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN8           (OSCCTRL_XOSCCTRL_GAIN_GAIN8_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 8 MHz Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN16          (OSCCTRL_XOSCCTRL_GAIN_GAIN16_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 16 MHz Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN32          (OSCCTRL_XOSCCTRL_GAIN_GAIN32_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 32 MHz Position  */
#define OSCCTRL_XOSCCTRL_AMPGC_Pos            _UINT16_(11)                                         /* (OSCCTRL_XOSCCTRL) Automatic Amplitude Gain Control Position */
#define OSCCTRL_XOSCCTRL_AMPGC_Msk            (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_AMPGC_Pos)        /* (OSCCTRL_XOSCCTRL) Automatic Amplitude Gain Control Mask */
#define OSCCTRL_XOSCCTRL_AMPGC(value)         (OSCCTRL_XOSCCTRL_AMPGC_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_AMPGC_Pos)) /* Assigment of value for AMPGC in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_STARTUP_Pos          _UINT16_(12)                                         /* (OSCCTRL_XOSCCTRL) Start-Up Time Position */
#define OSCCTRL_XOSCCTRL_STARTUP_Msk          (_UINT16_(0xF) << OSCCTRL_XOSCCTRL_STARTUP_Pos)      /* (OSCCTRL_XOSCCTRL) Start-Up Time Mask */
#define OSCCTRL_XOSCCTRL_STARTUP(value)       (OSCCTRL_XOSCCTRL_STARTUP_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_STARTUP_Pos)) /* Assigment of value for STARTUP in the OSCCTRL_XOSCCTRL register */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE1_Val _UINT16_(0x0)                                        /* (OSCCTRL_XOSCCTRL) 1 cycle  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE2_Val _UINT16_(0x1)                                        /* (OSCCTRL_XOSCCTRL) 2 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE4_Val _UINT16_(0x2)                                        /* (OSCCTRL_XOSCCTRL) 4 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE8_Val _UINT16_(0x3)                                        /* (OSCCTRL_XOSCCTRL) 8 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE16_Val _UINT16_(0x4)                                        /* (OSCCTRL_XOSCCTRL) 16 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE32_Val _UINT16_(0x5)                                        /* (OSCCTRL_XOSCCTRL) 32 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE64_Val _UINT16_(0x6)                                        /* (OSCCTRL_XOSCCTRL) 64 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE128_Val _UINT16_(0x7)                                        /* (OSCCTRL_XOSCCTRL) 128 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE256_Val _UINT16_(0x8)                                        /* (OSCCTRL_XOSCCTRL) 256 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE512_Val _UINT16_(0x9)                                        /* (OSCCTRL_XOSCCTRL) 512 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE1024_Val _UINT16_(0xA)                                        /* (OSCCTRL_XOSCCTRL) 1024 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE2048_Val _UINT16_(0xB)                                        /* (OSCCTRL_XOSCCTRL) 2048 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE4096_Val _UINT16_(0xC)                                        /* (OSCCTRL_XOSCCTRL) 4096 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE8192_Val _UINT16_(0xD)                                        /* (OSCCTRL_XOSCCTRL) 8192 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE16384_Val _UINT16_(0xE)                                        /* (OSCCTRL_XOSCCTRL) 16384 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE32768_Val _UINT16_(0xF)                                        /* (OSCCTRL_XOSCCTRL) 32768 cycles  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE1       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE1_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 1 cycle Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE2       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE2_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 2 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE4       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE4_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 4 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE8       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE8_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 8 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE16      (OSCCTRL_XOSCCTRL_STARTUP_CYCLE16_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 16 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE32      (OSCCTRL_XOSCCTRL_STARTUP_CYCLE32_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 32 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE64      (OSCCTRL_XOSCCTRL_STARTUP_CYCLE64_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 64 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE128     (OSCCTRL_XOSCCTRL_STARTUP_CYCLE128_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 128 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE256     (OSCCTRL_XOSCCTRL_STARTUP_CYCLE256_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 256 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE512     (OSCCTRL_XOSCCTRL_STARTUP_CYCLE512_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 512 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE1024    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE1024_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 1024 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE2048    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE2048_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 2048 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE4096    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE4096_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 4096 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE8192    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE8192_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 8192 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE16384   (OSCCTRL_XOSCCTRL_STARTUP_CYCLE16384_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 16384 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE32768   (OSCCTRL_XOSCCTRL_STARTUP_CYCLE32768_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 32768 cycles Position  */
#define OSCCTRL_XOSCCTRL_Msk                  _UINT16_(0xFFDE)                                     /* (OSCCTRL_XOSCCTRL) Register Mask  */


/* -------- OSCCTRL_CFDPRESC : (OSCCTRL Offset: 0x12) (R/W 8) Clock Failure Detector Prescaler -------- */
#define OSCCTRL_CFDPRESC_RESETVALUE           _UINT8_(0x00)                                        /*  (OSCCTRL_CFDPRESC) Clock Failure Detector Prescaler  Reset Value */

#define OSCCTRL_CFDPRESC_CFDPRESC_Pos         _UINT8_(0)                                           /* (OSCCTRL_CFDPRESC) Clock Failure Detector Prescaler Position */
#define OSCCTRL_CFDPRESC_CFDPRESC_Msk         (_UINT8_(0x7) << OSCCTRL_CFDPRESC_CFDPRESC_Pos)      /* (OSCCTRL_CFDPRESC) Clock Failure Detector Prescaler Mask */
#define OSCCTRL_CFDPRESC_CFDPRESC(value)      (OSCCTRL_CFDPRESC_CFDPRESC_Msk & (_UINT8_(value) << OSCCTRL_CFDPRESC_CFDPRESC_Pos)) /* Assigment of value for CFDPRESC in the OSCCTRL_CFDPRESC register */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV1_Val  _UINT8_(0x0)                                         /* (OSCCTRL_CFDPRESC)  OSC48M frequency  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV2_Val  _UINT8_(0x1)                                         /* (OSCCTRL_CFDPRESC)  OSC48M frequency / 2  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV4_Val  _UINT8_(0x2)                                         /* (OSCCTRL_CFDPRESC)  OSC48M frequency / 4  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV8_Val  _UINT8_(0x3)                                         /* (OSCCTRL_CFDPRESC)  OSC48M frequency / 8  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV16_Val _UINT8_(0x4)                                         /* (OSCCTRL_CFDPRESC) OSC48M frequency / 16  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV32_Val _UINT8_(0x5)                                         /* (OSCCTRL_CFDPRESC) OSC48M frequency / 32  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV64_Val _UINT8_(0x6)                                         /* (OSCCTRL_CFDPRESC) OSC48M frequency / 64  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV128_Val _UINT8_(0x7)                                         /* (OSCCTRL_CFDPRESC) OSC48M frequency / 128  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV1        (OSCCTRL_CFDPRESC_CFDPRESC_DIV1_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC)  OSC48M frequency Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV2        (OSCCTRL_CFDPRESC_CFDPRESC_DIV2_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC)  OSC48M frequency / 2 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV4        (OSCCTRL_CFDPRESC_CFDPRESC_DIV4_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC)  OSC48M frequency / 4 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV8        (OSCCTRL_CFDPRESC_CFDPRESC_DIV8_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC)  OSC48M frequency / 8 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV16       (OSCCTRL_CFDPRESC_CFDPRESC_DIV16_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC48M frequency / 16 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV32       (OSCCTRL_CFDPRESC_CFDPRESC_DIV32_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC48M frequency / 32 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV64       (OSCCTRL_CFDPRESC_CFDPRESC_DIV64_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC48M frequency / 64 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV128      (OSCCTRL_CFDPRESC_CFDPRESC_DIV128_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC48M frequency / 128 Position  */
#define OSCCTRL_CFDPRESC_Msk                  _UINT8_(0x07)                                        /* (OSCCTRL_CFDPRESC) Register Mask  */


/* -------- OSCCTRL_EVCTRL : (OSCCTRL Offset: 0x13) (R/W 8) Event Control -------- */
#define OSCCTRL_EVCTRL_RESETVALUE             _UINT8_(0x00)                                        /*  (OSCCTRL_EVCTRL) Event Control  Reset Value */

#define OSCCTRL_EVCTRL_CFDEO_Pos              _UINT8_(0)                                           /* (OSCCTRL_EVCTRL) Clock Failure Detector Event Output Enable Position */
#define OSCCTRL_EVCTRL_CFDEO_Msk              (_UINT8_(0x1) << OSCCTRL_EVCTRL_CFDEO_Pos)           /* (OSCCTRL_EVCTRL) Clock Failure Detector Event Output Enable Mask */
#define OSCCTRL_EVCTRL_CFDEO(value)           (OSCCTRL_EVCTRL_CFDEO_Msk & (_UINT8_(value) << OSCCTRL_EVCTRL_CFDEO_Pos)) /* Assigment of value for CFDEO in the OSCCTRL_EVCTRL register */
#define OSCCTRL_EVCTRL_Msk                    _UINT8_(0x01)                                        /* (OSCCTRL_EVCTRL) Register Mask  */


/* -------- OSCCTRL_OSC48MCTRL : (OSCCTRL Offset: 0x14) (R/W 8) 48MHz Internal Oscillator (OSC48M) Control -------- */
#define OSCCTRL_OSC48MCTRL_RESETVALUE         _UINT8_(0x82)                                        /*  (OSCCTRL_OSC48MCTRL) 48MHz Internal Oscillator (OSC48M) Control  Reset Value */

