Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_curiosity_pro/pic32cm_jh01_cpro_getting_started/firmware/src/packs/PIC32CM5164JH01100_DFP/component/oscctrl.h
/** \brief OSCCTRL register offsets definitions */
#define OSCCTRL_INTENCLR_REG_OFST      _UINT32_(0x00)      /* (OSCCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define OSCCTRL_INTENSET_REG_OFST      _UINT32_(0x04)      /* (OSCCTRL_INTENSET) Interrupt Enable Set Offset */
#define OSCCTRL_INTFLAG_REG_OFST       _UINT32_(0x08)      /* (OSCCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define OSCCTRL_STATUS_REG_OFST        _UINT32_(0x0C)      /* (OSCCTRL_STATUS) Power and Clocks Status Offset */
#define OSCCTRL_XOSCCTRL_REG_OFST      _UINT32_(0x10)      /* (OSCCTRL_XOSCCTRL) External Multipurpose Crystal Oscillator (XOSC) Control Offset */
#define OSCCTRL_CFDPRESC_REG_OFST      _UINT32_(0x12)      /* (OSCCTRL_CFDPRESC) Clock Failure Detector Prescaler Offset */
#define OSCCTRL_EVCTRL_REG_OFST        _UINT32_(0x13)      /* (OSCCTRL_EVCTRL) Event Control Offset */
#define OSCCTRL_OSC48MCTRL_REG_OFST    _UINT32_(0x14)      /* (OSCCTRL_OSC48MCTRL) 48MHz Internal Oscillator (OSC48M) Control Offset */
#define OSCCTRL_OSC48MDIV_REG_OFST     _UINT32_(0x15)      /* (OSCCTRL_OSC48MDIV) OSC48M Divider Offset */
#define OSCCTRL_OSC48MSTUP_REG_OFST    _UINT32_(0x16)      /* (OSCCTRL_OSC48MSTUP) OSC48M Startup Time Offset */
#define OSCCTRL_OSC48MSYNCBUSY_REG_OFST _UINT32_(0x18)      /* (OSCCTRL_OSC48MSYNCBUSY) OSC48M Synchronization Busy Offset */
#define OSCCTRL_DPLLCTRLA_REG_OFST     _UINT32_(0x1C)      /* (OSCCTRL_DPLLCTRLA) DPLL Control Offset */
#define OSCCTRL_DPLLRATIO_REG_OFST     _UINT32_(0x20)      /* (OSCCTRL_DPLLRATIO) DPLL Ratio Control Offset */
#define OSCCTRL_DPLLCTRLB_REG_OFST     _UINT32_(0x24)      /* (OSCCTRL_DPLLCTRLB) Digital Core Configuration Offset */
#define OSCCTRL_DPLLPRESC_REG_OFST     _UINT32_(0x28)      /* (OSCCTRL_DPLLPRESC) DPLL Prescaler Offset */
#define OSCCTRL_DPLLSYNCBUSY_REG_OFST  _UINT32_(0x2C)      /* (OSCCTRL_DPLLSYNCBUSY) DPLL Synchronization Busy Offset */
#define OSCCTRL_DPLLSTATUS_REG_OFST    _UINT32_(0x30)      /* (OSCCTRL_DPLLSTATUS) DPLL Status Offset */
#define OSCCTRL_CAL48M_REG_OFST        _UINT32_(0x38)      /* (OSCCTRL_CAL48M) 48MHz Oscillator Calibration Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief OSCCTRL register API structure */
typedef struct
{  /* Oscillators Control */
  __IO  uint32_t                       OSCCTRL_INTENCLR;   /**< Offset: 0x00 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       OSCCTRL_INTENSET;   /**< Offset: 0x04 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       OSCCTRL_INTFLAG;    /**< Offset: 0x08 (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       OSCCTRL_STATUS;     /**< Offset: 0x0C (R/   32) Power and Clocks Status */
  __IO  uint16_t                       OSCCTRL_XOSCCTRL;   /**< Offset: 0x10 (R/W  16) External Multipurpose Crystal Oscillator (XOSC) Control */
  __IO  uint8_t                        OSCCTRL_CFDPRESC;   /**< Offset: 0x12 (R/W  8) Clock Failure Detector Prescaler */
  __IO  uint8_t                        OSCCTRL_EVCTRL;     /**< Offset: 0x13 (R/W  8) Event Control */
  __IO  uint8_t                        OSCCTRL_OSC48MCTRL; /**< Offset: 0x14 (R/W  8) 48MHz Internal Oscillator (OSC48M) Control */
  __IO  uint8_t                        OSCCTRL_OSC48MDIV;  /**< Offset: 0x15 (R/W  8) OSC48M Divider */
  __IO  uint8_t                        OSCCTRL_OSC48MSTUP; /**< Offset: 0x16 (R/W  8) OSC48M Startup Time */
  __I   uint8_t                        Reserved1[0x01];
  __I   uint32_t                       OSCCTRL_OSC48MSYNCBUSY; /**< Offset: 0x18 (R/   32) OSC48M Synchronization Busy */
  __IO  uint8_t                        OSCCTRL_DPLLCTRLA;  /**< Offset: 0x1C (R/W  8) DPLL Control */
  __I   uint8_t                        Reserved2[0x03];
  __IO  uint32_t                       OSCCTRL_DPLLRATIO;  /**< Offset: 0x20 (R/W  32) DPLL Ratio Control */
  __IO  uint32_t                       OSCCTRL_DPLLCTRLB;  /**< Offset: 0x24 (R/W  32) Digital Core Configuration */
  __IO  uint8_t                        OSCCTRL_DPLLPRESC;  /**< Offset: 0x28 (R/W  8) DPLL Prescaler */
  __I   uint8_t                        Reserved3[0x03];
  __I   uint8_t                        OSCCTRL_DPLLSYNCBUSY; /**< Offset: 0x2C (R/   8) DPLL Synchronization Busy */
  __I   uint8_t                        Reserved4[0x03];
  __I   uint8_t                        OSCCTRL_DPLLSTATUS; /**< Offset: 0x30 (R/   8) DPLL Status */
  __I   uint8_t                        Reserved5[0x07];
  __IO  uint32_t                       OSCCTRL_CAL48M;     /**< Offset: 0x38 (R/W  32) 48MHz Oscillator Calibration */
} oscctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMJH01_OSCCTRL_COMPONENT_H_ */
